InformationRegisters/ИА_ТегиИнструкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ТегиИнструкций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Релевантность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тег</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИА_Инструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Инструкции</Name>
			<Comment>Должностные инструкции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКолонтитула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВремКаталогаВорд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияГугл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаГуглДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсемСотрудникам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_Инструкции/Ext/Module.bsl
Процедура ОбновитьТегиПоИнструкции(Инструкция) Экспорт
	
	Если не ЗначениеЗаполнено(Инструкция.Текст) Тогда
		НаборТегов = РегистрыСведений.ИА_ТегиИнструкций.СоздатьНаборЗаписей();
		НаборТегов.Отбор.Инструкция.Установить(Инструкция.Ссылка, Истина);
		НаборТегов.Очистить();
		НаборТегов.Записать(Истина);
		
		Возврат;
	КонецЕсли;
	
	ТаблТегов = Новый ТаблицаЗначений;
	ТаблТегов.Колонки.Добавить("Тег", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблТегов.Колонки.Добавить("Релевантность", Новый ОписаниеТипов("Число"));
	
	Текст = СтрЗаменить(Инструкция.Текст,"<META content=IE=9 http-equiv=X-UA-Compatible>","");
	Текст = СтрЗаменить(Текст,"<META http-equiv=X-UA-Compatible content=IE=9>","");
	
	НовыйHTMLДокумент = Новый COMОбъект("HtmlFile");
	НовыйHTMLДокумент.open("text/html");
	НовыйHTMLДокумент.write(Текст);
	
	Текст = СтрЗаменить(НовыйHTMLДокумент.all.tags("html").item(0).innerText," ",Символы.ПС);
	Для Н = 1 По СтрЧислоСтрок(Текст) Цикл
		
		Тег = ВРЕГ(СокрЛП(СтрПолучитьСтроку(Текст, Н)));
		
		Если Тег<>"" Тогда
			стр = ТаблТегов.Добавить();
			стр.Тег =  Тег;
			стр.Релевантность = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Текст = СтрЗаменить(Инструкция.Наименование," ",Символы.ПС);
	Для Н = 1 По СтрЧислоСтрок(Текст) Цикл
		
		Тег = ВРЕГ(СокрЛП(СтрПолучитьСтроку(Текст, Н)));
		
		Если Тег<>"" Тогда
			стр = ТаблТегов.Добавить();
			стр.Тег =  Тег;
			стр.Релевантность = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблТегов.Индексы.Добавить("Тег");
	ТаблТегов.Свернуть("Тег","Релевантность");
	ТаблТегов.Колонки.Добавить("Инструкция");
	ТаблТегов.ЗаполнитьЗначения(Инструкция.Ссылка, "Инструкция");
	
	НаборТегов = РегистрыСведений.ИА_ТегиИнструкций.СоздатьНаборЗаписей();
	НаборТегов.Отбор.Инструкция.Установить(Инструкция.Ссылка, Истина);
	НаборТегов.Загрузить(ТаблТегов);
	НаборТегов.Записать(Истина);
	
КонецПроцедуры

Функция ПреобразоватьБуквыИзКодов(текстХТМЛ) Экспорт
	рез = текстХТМЛ; 
	Для сч = 1040 по 1103 Цикл
		рез = СтрЗаменить(рез,"&#"+формат(сч,"ЧРГ=; ЧГ=")+";", Символ(сч));
	КонецЦикла;
	Для сч = 0 по 122 Цикл
		рез = СтрЗаменить(рез,"&#"+формат(сч,"ЧРГ=; ЧГ=")+";", Символ(сч));
	КонецЦикла;
	
	рез = СтрЗаменить(рез,"&#1025;", Символ(1025));
	рез = СтрЗаменить(рез,"&#1105;", Символ(1105));
	рез = СтрЗаменить(рез,"&#32;", Символ(32));
	
	возврат рез;
КонецФункции

Функция ПолучитьТекстИнструкцииГугл(пСсылка) Экспорт
	access_token = ПолучитьAccessTokenИзRefresh();
	уид = ПолучитьУидИзСсылкиГугл(пСсылка);
	
	Соединение = Новый HTTPСоединение("www.googleapis.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	рез = ПолучитьТекстИнструкцииГуглПоИД_Токен_Соединение(уид, access_token, Соединение);
	Возврат рез;
КонецФункции

Функция ПолучитьТекстИнструкцииГуглПоИД_Токен_Соединение(уид, access_token, Соединение) Экспорт
	
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Authorization","Bearer " + access_token);
	Запрос = Новый HTTPЗапрос("/drive/v3/files/"+уид+"/export?mimeType=application%2fzip", хеадерс);    

	Результат = Соединение.Получить(Запрос);
	дд = Результат.ПолучитьТелоКакДвоичныеДанные();
	хтмл = ИА_Защита_ДИ.ОбработатьАрхивДок(дд);
	Возврат хтмл;
КонецФункции

Функция ПолучитьУидИзСсылкиГугл(ссылка) Экспорт
	сс = СтрЗаменить(ссылка,"https://docs.google.com/document/d/","");
	сс = лев(сс,44);
	
	Возврат сс;
КонецФункции

Функция ПолучитьДатыИзменений(ссылка) Экспорт
	access_token = ПолучитьAccessTokenИзRefresh();
	уид = ПолучитьУидИзСсылкиГугл(ссылка);
	
	Соединение = Новый HTTPСоединение("www.googleapis.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Authorization","Bearer " + access_token);
	
	Запрос = Новый HTTPЗапрос("/drive/v3/files/"+уид+"/revisions", хеадерс);    
	Результат = Соединение.Получить(Запрос);
	рез = Результат.ПолучитьТелоКакСтроку();
	
	
	Если Результат.КодСостояния = 200 Тогда		
		возврат ПолучитьДатыИзмененийПоСтрокеJSON(рез);
	Иначе
		возврат новый массив;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьДатыИзмененийПоСтрокеJSON(строкаJSON) Экспорт
	МассивДат = Новый Массив;
	
	JSon = Новый ЧтениеJSON;
	JSon.УстановитьСтроку(строкаJSON);
	Ревизии = ПрочитатьJSON(JSon);
	Для каждого рев из Ревизии.revisions Цикл
		рДата = рев.modifiedTime;
		рДата = СтрЗаменить(рДата,"T","");
		рДата = СтрЗаменить(рДата,"-","");
		рДата = СтрЗаменить(рДата,":","");
		рДата = лев(рДата,14);       
		МассивДат.Вставить(0, Новый структура("ДатаИзменения,ид",Дата(рДата),рев.id));
	КонецЦикла;
	
	Возврат МассивДат; 
КонецФункции

Процедура АктуализацияGoogle() Экспорт
	access_token = ПолучитьAccessTokenИзRefresh();
	
	Соединение = Новый HTTPСоединение("www.googleapis.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Authorization","Bearer " + access_token);
	ЗапросHTTP = Новый HTTPЗапрос(); 
	ЗапросHTTP.Заголовки = хеадерс;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Инструкции.Ссылка,
	               |	ИА_Инструкции.СсылкаГуглДок,
	               |	ИА_Инструкции.ДатаОбновленияГугл
	               |ИЗ
	               |	Справочник.ИА_Инструкции КАК ИА_Инструкции
	               |ГДЕ
	               |	ИА_Инструкции.СсылкаГуглДок <> """"";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			уид = ПолучитьУидИзСсылкиГугл(Выборка.СсылкаГуглДок);
			ЗапросHTTP.АдресРесурса = "/drive/v3/files/"+уид+"/revisions";    
			Результат = Соединение.Получить(ЗапросHTTP);
			рез = Результат.ПолучитьТелоКакСтроку();			
			Если Результат.КодСостояния = 200 Тогда		
				датыРев = ПолучитьДатыИзмененийПоСтрокеJSON(рез);
				Если датыРев.Количество()>0 и датыРев[0].ДатаИзменения > Выборка.ДатаОбновленияГугл Тогда
					ОбъектИнст = Выборка.Ссылка.ПолучитьОбъект();
					ОбъектИнст.Текст = ПолучитьТекстИнструкцииГугл(Выборка.СсылкаГуглДок);
					ОбъектИнст.ДатаОбновленияГугл = датыРев[0].ДатаИзменения;
					ОбъектИнст.Записать();
				КонецЕсли;
			КонецЕсли;
		Исключение
			ЗаписьЖурналаРегистрации("КСУ_АктуализацияGoogle", УровеньЖурналаРегистрации.Ошибка, , ,ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

// регламентное задание:
Процедура КСУ_ДИ_АктуализацияGoogle() Экспорт
	Если Константы.ИА_ДИ_ИспользоватьGoogleДокументы.Получить() = Ложь Тогда
		возврат;
	КонецЕсли;
	АктуализацияGoogle();
КонецПроцедуры

Функция ПолучитьAccessTokenИзRefresh() Экспорт
	Проект = ИА_КСУОбщийСервер.ПолучитьДанныеПроектаКСУ();
	
	refresh_token = Константы.ИА_ДИ_Токен.Получить();
	Если refresh_token = "" Тогда
		ВызватьИсключение "Вы не настроили доступ к Google. Перейдите в настройки КСУ.";
	КонецЕсли;
	
	ПараметрыPOST = "grant_type=refresh_token&client_id=" + Проект.client_id + "&client_secret=" + Проект.client_secret + "&refresh_token=" + refresh_token;
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Content-Type","application/x-www-form-urlencoded");

	Соединение = Новый HTTPСоединение("www.googleapis.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
	Запрос = Новый HTTPЗапрос("/oauth2/v4/token", хеадерс);

	Запрос.УстановитьТелоИзСтроки(ПараметрыPOST, КодировкаТекста.Системная);
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	
	JSon = Новый ЧтениеJSON;
	JSon.УстановитьСтроку(ТекстОтвета);
	рез = ПрочитатьJSON(JSon);
	
	Возврат рез.access_token;
	
КонецФункции
